const menuData: any[] = [
  {
    id: 1,
    content:
      'Сайн байна уу? 👋 Таны хүсэлтийн дагуу бид таньтай холболгдож байна. Та юу сонирхож байна вэ?',
    user: 0,
  },
  {
    id: 2,
    content: 'Sain baina uu?',
    user: 1,
  },
  {
    id: '3',
    content: 'Tanai barinliin materialiig sonirxoj bna',
    user: 1,
  },
  {
    id: 4,
    content: 'Ymar2 bvteegdexvvn bga we ? vne xansh n xed we ?',
    user: 1,
  },
  {
    id: 5,
    content:
      'Байден сонгуулийн хандив цуглуулах арга хэмжээнүүдэд оролцохоор Баруун Эргийн бүс нутагт гурван өдөр саатах юм.',
    user: 0,
  },
  {
    id: 6,
    content:
      'Байден ер нь сонгуулийн ихэнх хандивын арга хэмжээнүүдийг хаалттай зохион байгуулж, хөшигний ард илэн далангүй ярьдаг уламжлалтай.',
    user: 0,
  },
  {
    id: 7,
    content: 'Эдийн засгийн хүндрэлтэй Шри-Ланка улсад ч энэ гэрээ бас ашигтай юм.',
    user: 0,
  },
  {
    id: 8,
    content: 'Тэр үеэс хойш иржээ.',
    user: 0,
  },
];

export default menuData;
